Repository: eliavco/medabrim-schlichut
Catalog: src/locale/messages.*.xlf
Languages: he

source: Medabrim Schlichut
he: מדברים שליחות

source: Medbarim Schlichut
he: מדברים שליחות

source: by Asi Aharonov PhD.
he: עם ד"ר אסי אהרונוב

source: Welcome to the podcast Medabrim Schlichut (literally - Talking Mission) - the only podcast that gives a stage to Israeli Schlichim.<br/> We interview past and present Schlichim who share their experiences with us.<br/> A lot of their experiences are mutual, though many are unique.<br/> Wether you consider going on a Schlichut, are on a Schlichut or were on a Schlichut - you will find here inspiration, important insights and useful tips through the Schlichim's stories.<br/> Everywhere you are, in Israel or abroad, on foot or in your car - you are invited to listen to the podcast that talks with the Schlichim eye to eye
he: ברוכים הבאים לפודקאסט מדברים שליחות, הפודקאסט היחיד שנותן במה לשליחים, עבור השליחים. אנחנו מראיינים שליחים בעבר או בהווה, שישתפו בחוויית השליחות שלהם. רבות מהחוויות הללו הן משותפות, רבות מהן - ייחודיות.<br/> בין אם אתם חושבים לצאת לשליחות, נמצאים בשליחות או שכבר הייתם בשליחות – תוכלו למצוא כאן השראה, תובנות חשובות, וטיפים באמצעות סיפוריהם של השליחים.<br/> בכל מקום בו אתם נמצאים – בארץ או בחו"ל, בהליכה או ברכב – אתם מוזמנים להאזין לפודקאסט שמדבר עם השליחים ועל השליחות בגובה העיניים.

source: LISTEN
he: האזן

source: CONTACT
he: צור קשר

source: SHARE
he: שתף

source: Contact
he: צור קשר

source: Your Name
he: שם מלא

source: John Smith
he: ישראל ישראלי

source: Name is <strong>required</strong>
he: שם הוא <strong>שדה חובה</strong>

source: Subject
he: נושא

source: Great Podcast!
he: תסכית נהדר!

source: Subject is <strong>required</strong>
he: נושא הוא <strong>שדה חובה</strong>

source: Email
he: כתובת מייל

source: Ex. pat@example.com
he: israel@example.com

source: Please enter a valid email address
he: אנא הכנס כתובת מייל תקינה

source: Email is <strong>required</strong>
he: כתובת מייל הוא <strong>שדה חובה</strong>

source: Message
he: הודעה

source: I had some ideas for the podcast...
he: יש לי כמה רעיונות לפודקאסט

source: Message is <strong>required</strong>
he: הודעה היא <strong>שדה חובה</strong>

source: SUBMIT
he: שלח

source: Medabrim
he: מדברים

source: Schlichut
he: שליחות

source: THE podcast for Israeli expatriates around the world
he: ה-פודקאסט עבור השליחים לקהילות היהודיות ברחבי העולם

source: ABOUT
he: אודות

source: LISTEN
he: האזן

source: CONTACT
he: צור קשר
